{
    "metadata": {
        "id": "vellynne-session2",
        "sender": {
            "name": "Vellynne Harpell",
            "title": "Correspondence from Vellynne Harpell",
            "subtitle": "Tenth Black Staff of Blackstaff Academy"
        },
        "recipient": "Rothbart",
        "date": {
            "datetime": "1490",
            "display": "1490 DR, Hammer (Third Tenday)"
        },
        "deliveryMethod": "Delivered by snowy owl familiar"
    },
    "content": {
        "greeting": "Rothbart,",
        "paragraphs": [
            {
                "id": "1",
                "type": "body",
                "text": "I confess myself rather perplexed by your recent acquisition. The Wand of Orcus—even contemplating those words sends tremors through the Weave itself. Here I believed I was corresponding with a mature paladin dedicated to the eradication of undead, yet you appear to be tugging at the very threads of reality as the negative material plane seeps through the cracks. Perhaps I overestimated your wisdom, my half-undead friend."
            },
            {
                "id": "2", 
                "type": "body",
                "text": "Nevertheless, I must express grudging admiration for this unprecedented discovery. The appearance of such an artifact in a mere mage's possession represents an extraordinary occurrence that demands investigation. I harbor serious doubts regarding its authenticity—surely Orcus himself would be tearing across the planes searching for his true wand were it genuinely lost. Yet the disturbances in the Weave I detected during my examination suggest this is no common forgery, but rather a replica of remarkable potency."
            },
            {
                "id": "3",
                "type": "body",
                "text": "This brings to mind the legendary Meltharond, that ancient wizard who rode upon the back of Arveiaturace, the great white dragon. Your party's slaying of the magnificent beast was truly a mercy—she had been mad with grief for centuries, conversing endlessly with her beloved rider's corpse. I trust the items you recovered from Meltharond's remains proved worthwhile. The irony would be delicious if your paladin's oath were now bound to an artifact once coveted by such a devoted practitioner of the arcane arts—particularly one whose obsession with power ultimately led to centuries of undeath."
            },
            {
                "id": "4",
                "type": "body",
                "text": "I have dispatched correspondence to several colleagues within the Arcane Brotherhood who possess expertise in artifact identification. Should my suspicions prove correct, we may be dealing with something far more dangerous than a simple replica. I shall inform you of their findings, assuming you can maintain sufficient control over your increasingly chaotic party to remain useful."
            },
            {
                "id": "5",
                "type": "body",
                "text": "On a more immediately practical matter, I took the liberty of interrogating the remains of those vampire brides your group so efficiently dispatched. The dead can be remarkably forthcoming when properly motivated. They revealed that their Elder seeks the location of a third bride, and their assault upon your caravan was intended to demonstrate their worthiness to him. Most intriguingly, they proved capable of providing a name but were rendered unable to speak it—clear evidence that their master maintains dominion over them even in death."
            },
            {
                "id": "6",
                "type": "body",
                "text": "This has rather disturbing implications for your own condition, dear dampir. If this vampire lord possesses such profound control over the undead, your unique nature may make you particularly vulnerable to his influence. I recommend extreme caution in any future encounters, as your divine protections may prove insufficient against such ancient power."
            },
            {
                "id": "7",
                "type": "body",
                "text": "Do take care not to let that theatrical bard of yours meddle with forces beyond his comprehension. The Weave grows more unstable with each passing day, and we can ill afford additional complications."
            }
        ],
        "closing": "With scholarly concern and perpetual fascination,",
        "signature": {
            "name": "Vellynne Harpell",
            "title": "Tenth Black Staff of Blackstaff Academy"
        },
        "postscript": "I trust you'll exercise more discretion with that wand than Macreadus did with his collection. Though your current behaviour has done little to convince me."
    }
}

